In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.4.2'

In [322]:
#!pip install sqlalchemy psycopg2-binary

In [4]:
from sqlalchemy import create_engine

In [351]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

In [352]:
engine.connect()

In [353]:
query = ''' SELECT 1 as number;'''
pd.read_sql(query, con=engine)

   number
0       1

In [80]:
query = ''' SELECT * 
FROM pg_catalog.pg_tables
WHERE schemaname != 'pg_catalog'
AND
schemaname != 'information_shema'; '''
pd.read_sql(query, con=engine)

,schemaname,tablename,tableowner,tablespace,hasindexes,hasrules,hastriggers,rowsecurity
0,public,yellow_tripdata_2021,root,None,False,False,False,False
1,public,yellow_tripdata_2021_1,root,None,False,False,False,False
2,information_schema,sql_implementation_info,root,None,False,False,False,False
3,information_schema,sql_parts,root,None,False,False,False,False
4,information_schema,sql_sizing,root,None,False,False,False,False
5,information_schema,sql_features,root,None,False,False,False,False

In [5]:
#df = pd.read_csv('yellow_tripdata_2021-01.csv', nrows=100)

In [29]:
#df = pd.read_csv("https://github.com/DataTalksClub/nyc-tlc-data/releases/download/yellow/yellow_tripdata_2021-01.csv.gz", nrows=100)

In [95]:
df1 = pd.read_csv("taxi+_zone_lookup.csv")

In [96]:
df1.head()

   LocationID        Borough                     Zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone

In [81]:
df = pd.read_csv("https://github.com/DataTalksClub/nyc-tlc-data/releases/download/green/green_tripdata_2019-01.csv.gz")

In [34]:
#df.to_csv("c:/Users/ilkca/DATA_ENG_CAMP/data-engineering-zoomcamp/week_1_basics_n_setup/2_docker_sql/yellow_tripdata_2021-01.csv")

In [82]:
df.shape

(630918, 20)

In [84]:
df.head()

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,2,2018-12-21 15:17:29,2018-12-21 15:18:57,N,1,264,264,5,0.00,3.0,0.5,0.5,0.00,0.0,NaN,0.3,4.30,2,1,NaN
1,2,2019-01-01 00:10:16,2019-01-01 00:16:32,N,1,97,49,2,0.86,6.0,0.5,0.5,0.00,0.0,NaN,0.3,7.30,2,1,NaN
2,2,2019-01-01 00:27:11,2019-01-01 00:31:38,N,1,49,189,2,0.66,4.5,0.5,0.5,0.00,0.0,NaN,0.3,5.80,1,1,NaN
3,2,2019-01-01 00:46:20,2019-01-01 01:04:54,N,1,189,17,2,2.68,13.5,0.5,0.5,2.96,0.0,NaN,0.3,19.71,1,1,NaN
4,2,2019-01-01 00:19:06,2019-01-01 00:39:43,N,1,82,258,1,4.53,18.0,0.5,0.5,0.00,0.0,NaN,0.3,19.30,2,1,NaN

In [86]:
df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)

In [87]:
df.to_sql(name = 'yellow_tripdata_2019', con=engine, index=False)

918

In [308]:
query = ''' SELECT * 
FROM yellow_tripdata_2019; '''
pd.read_sql(query, con=engine)

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,2,2018-12-21 15:17:29,2018-12-21 15:18:57,N,1,264,264,5,0.00,3.0,0.5,0.5,0.00,0.0,None,0.3,4.30,2,1,NaN
1,2,2019-01-01 00:10:16,2019-01-01 00:16:32,N,1,97,49,2,0.86,6.0,0.5,0.5,0.00,0.0,None,0.3,7.30,2,1,NaN
2,2,2019-01-01 00:27:11,2019-01-01 00:31:38,N,1,49,189,2,0.66,4.5,0.5,0.5,0.00,0.0,None,0.3,5.80,1,1,NaN
3,2,2019-01-01 00:46:20,2019-01-01 01:04:54,N,1,189,17,2,2.68,13.5,0.5,0.5,2.96,0.0,None,0.3,19.71,1,1,NaN
4,2,2019-01-01 00:19:06,2019-01-01 00:39:43,N,1,82,258,1,4.53,18.0,0.5,0.5,0.00,0.0,None,0.3,19.30,2,1,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
630913,2,2019-01-31 23:08:27,2019-01-31 23:22:59,N,1,255,226,1,3.33,13.0,0.5,0.5,2.14,0.0,None,0.3,18.39,1,1,0.0
630914,2,2019-01-31 23:21:26,2019-01-31 23:23:05,N,1,75,151,1,0.72,4.0,0.5,0.5,1.06,0.0,None,0.3,6.36,1,1,0.0
630915,2,2019-01-31 23:30:05,2019-01-31 23:36:14,N,1,75,238,1,1.75,7.0,0.5,0.5,0.00,0.0,None,0.3,8.30,1,1,0.0
630916,2,2019-01-31 23:59:58,2019-02-01 00:04:18,N,1,74,74,1,0.57,5.0,0.5,0.5,1.00,0.0,None,0.3,7.30,1,1,0.0
630917,2,2019-01-31 23:18:22,2019-01-31 23:26:06,N,1,75,262,1,2.11,8.5,0.5,0.5,1.96,0.0,None,0.3,11.76,1,1,0.0

Question_3
How many taxi trips were totally made on January 15?

In [310]:
query = ''' SELECT count(* )
FROM yellow_tripdata_2019 
WHERE lpep_pickup_datetime ::date='2019-01-15 '; '''
pd.read_sql(query, con=engine)

   count
0  20689

Question_4
Which was the day with the largest trip distance?

In [93]:
query = ''' SELECT date_trunc('day', lpep_pickup_datetime) as date,
max(trip_distance  ) as dis
FROM yellow_tripdata_2019 
group by date
order by dis desc
limit 2; '''
pd.read_sql(query, con=engine)

        date     dis
0 2019-01-15  117.99
1 2019-01-18   80.96

Question_5
In 2019-01-01 how many trips had 2 and 3 passengers?

In [343]:
#df.columns

In [100]:
df.rename(columns={'DOLocationID': 'LocationID'}, inplace=True)

In [318]:
# Merge DataFrames by Column
df2=pd.merge(df,df1, on='LocationID', how='left')

In [321]:
#df2.head()

In [273]:
#df2.lpep_pickup_datetime=df2.lpep_pickup_datetime.dt.date

In [274]:
#df2.lpep_dropoff_datetime=df2.lpep_dropoff_datetime.dt.date

In [344]:
#df2.head()

In [320]:
df2.to_sql(name = 'merge_data1', con=engine, index=False)

918

In [313]:
print(pd.io.sql.get_schema(df2, name="merge_data"))

CREATE TABLE "merge_data" (
"VendorID" INTEGER,
  "lpep_pickup_datetime" DATE,
  "lpep_dropoff_datetime" DATE,
  "store_and_fwd_flag" TEXT,
  "RatecodeID" INTEGER,
  "PULocationID" INTEGER,
  "LocationID" INTEGER,
  "passenger_count" INTEGER,
  "trip_distance" REAL,
  "fare_amount" REAL,
  "extra" REAL,
  "mta_tax" REAL,
  "tip_amount" REAL,
  "tolls_amount" REAL,
  "ehail_fee" REAL,
  "improvement_surcharge" REAL,
  "total_amount" REAL,
  "payment_type" INTEGER,
  "trip_type" INTEGER,
  "congestion_surcharge" REAL,
  "Borough" TEXT,
  "Zone" TEXT,
  "service_zone" TEXT
)

In [342]:
query = ''' SELECT passenger_count , lpep_pickup_datetime
FROM merge_data1 
WHERE lpep_pickup_datetime ::date= '2019-01-01' and passenger_count = 2
;'''
pd.read_sql(query, con=engine)

      passenger_count lpep_pickup_datetime
0                   2  2019-01-01 00:10:16
1                   2  2019-01-01 00:27:11
2                   2  2019-01-01 00:46:20
3                   2  2019-01-01 00:13:48
4                   2  2019-01-01 00:40:23
...               ...                  ...
1277                2  2019-01-01 23:08:38
1278                2  2019-01-01 23:33:40
1279                2  2019-01-01 23:34:15
1280                2  2019-01-01 23:08:14
1281                2  2019-01-01 23:42:48

[1282 rows x 2 columns]

In [341]:
query = ''' SELECT passenger_count , lpep_pickup_datetime
FROM merge_data1 
WHERE lpep_pickup_datetime ::date= '2019-01-01' and passenger_count = 3
;'''
pd.read_sql(query, con=engine)

     passenger_count lpep_pickup_datetime
0                  3  2019-01-01 00:08:07
1                  3  2019-01-01 00:31:28
2                  3  2019-01-01 00:39:51
3                  3  2019-01-01 00:35:40
4                  3  2019-01-01 00:09:09
..               ...                  ...
249                3  2019-01-01 22:59:53
250                3  2019-01-01 22:15:36
251                3  2019-01-01 23:20:47
252                3  2019-01-01 23:16:50
253                3  2019-01-01 23:34:57

[254 rows x 2 columns]

Question_6
For the passengers picked up in the Astoria Zone which was the drop up zone that had the largest tip?

In [403]:
df2.loc[df2["Zone"]=="Astoria"][["tip_amount", "Borough"]].sort_values(by=['tip_amount'], ascending=False)

        tip_amount Borough
610078       62.22  Queens
309536       20.00  Queens
4014         18.16  Queens
480960       15.00  Queens
190451       15.00  Queens
...            ...     ...
328906        0.00  Queens
329014        0.00  Queens
329205        0.00  Queens
304457        0.00  Queens
118582       -0.66  Queens

[16580 rows x 2 columns]

In [405]:
list(df2.Zone.unique())

['NV',
 'Clinton Hill',
 'Prospect Heights',
 'Bedford',
 'Woodhaven',
 'Brooklyn Heights',
 'Stuyvesant Heights',
 'Flatbush/Ditmas Park',
 'Canarsie',
 'Upper West Side North',
 'Jackson Heights',
 'East Flatbush/Farragut',
 'Ocean Hill',
 'East Williamsburg',
 'Sutton Place/Turtle Bay North',
 'TriBeCa/Civic Center',
 'Astoria',
 'Maspeth',
 'Greenpoint',
 'East Chelsea',
 'Crown Heights South',
 'Woodside',
 'Steinway',
 'Park Slope',
 'Williamsburg (South Side)',
 'Williamsbridge/Olinville',
 'Parkchester',
 'Cobble Hill',
 'Bay Ridge',
 'Central Harlem North',
 'Yorkville East',
 'Kips Bay',
 'Bronxdale',
 'Flatlands',
 'Downtown Brooklyn/MetroTech',
 'Brownsville',
 'East Harlem North',
 'Long Island City/Queens Plaza',
 'Upper East Side South',
 'Long Island City/Hunters Point',
 'Forest Hills',
 'Yorkville West',
 'Crown Heights North',
 'Bensonhurst East',
 'Fordham South',
 'UN/Turtle Bay South',
 'Williamsburg (North Side)',
 'Penn Station/Madison Sq West',
 'Hamilton Heights',
 'Melrose South',
 'Central Harlem',
 'South Ozone Park',
 'Elmhurst/Maspeth',
 'Sunset Park East',
 'Stuy Town/Peter Cooper Village',
 'Carroll Gardens',
 'East Elmhurst',
 'Lincoln Square West',
 'Soundview/Castle Hill',
 'Red Hook',
 'Lincoln Square East',
 'Midtown North',
 'Mott Haven/Port Morris',
 'Sheepshead Bay',
 'Bensonhurst West',
 'Richmond Hill',
 'Washington Heights South',
 'Two Bridges/Seward Park',
 'East Harlem South',
 'Old Astoria',
 'Times Sq/Theatre District',
 'Rego Park',
 'Gravesend',
 'Financial District North',
 'Inwood',
 'Boerum Hill',
 'Baisley Park',
 'Saint Albans',
 'Coney Island',
 'Prospect-Lefferts Gardens',
 'Pelham Parkway',
 'Hollis',
 'Corona',
 'North Corona',
 'Schuylerville/Edgewater Park',
 'Highbridge',
 'Ridgewood',
 'East Concourse/Concourse Village',
 'Upper East Side North',
 'Elmhurst',
 nan,
 'Washington Heights North',
 'Fort Greene',
 'Manhattanville',
 'Lower East Side',
 'East Tremont',
 'Rockaway Park',
 'Kingsbridge Heights',
 'West Concourse',
 'Sunnyside',
 'Crotona Park East',
 'Soundview/Bruckner',
 'Morningside Heights',
 'Windsor Terrace',
 'Bushwick South',
 'Homecrest',
 'Rosedale',
 'Flushing',
 'Prospect Park',
 'Meatpacking/West Village West',
 'Hudson Sq',
 'Kensington',
 'Eastchester',
 'Midtown East',
 'Upper West Side South',
 'Morrisania/Melrose',
 'Queens Village',
 'Starrett City',
 'Gramercy',
 'Sunset Park West',
 'Co-Op City',
 'Little Italy/NoLiTa',
 'Middle Village',
 'Spuyten Duyvil/Kingsbridge',
 'Mount Hope',
 'Murray Hill',
 'Bloomingdale',
 'Clinton West',
 'East Village',
 'Hillcrest/Pomonok',
 'SoHo',
 'West Chelsea/Hudson Yards',
 'Jamaica',
 'Queensbridge/Ravenswood',
 'Erasmus',
 'Woodlawn/Wakefield',
 'Hunts Point',
 'Highbridge Park',
 'East New York',
 'Lenox Hill West',
 'Gowanus',
 'Lenox Hill East',
 'Flatiron',
 'Cypress Hills',
 'East New York/Pennsylvania Avenue',
 'Murray Hill-Queens',
 'Columbia Street',
 'Oakland Gardens',
 'Union Sq',
 'Clinton East',
 'Midwood',
 'Battery Park City',
 'South Jamaica',
 'Van Cortlandt Village',
 'Midtown South',
 'Glendale',
 'Briarwood/Jamaica Hills',
 'Kew Gardens',
 'Manhattan Valley',
 'Greenwich Village North',
 'University Heights/Morris Heights',
 'Springfield Gardens South',
 'Hammels/Arverne',
 'Bath Beach',
 'Bushwick North',
 'Jamaica Estates',
 'East Flatbush/Remsen Village',
 'West Village',
 'Brighton Beach',
 'DUMBO/Vinegar Hill',
 'Marine Park/Mill Basin',
 'Fresh Meadows',
 'JFK Airport',
 'Cambria Heights',
 'Claremont/Bathgate',
 'Ozone Park',
 'South Williamsburg',
 'Longwood',
 'Chinatown',
 'Allerton/Pelham Gardens',
 'Queensboro Hill',
 'New Dorp/Midland Beach',
 'Central Park',
 'West Farms/Bronx River',
 'Greenwich Village South',
 'Far Rockaway',
 'LaGuardia Airport',
 'Alphabet City',
 'Norwood',
 'Belmont',
 'Bellerose',
 'Seaport',
 'Midtown Center',
 'Springfield Gardens North',
 'Whitestone',
 'Pelham Bay',
 'Borough Park',
 'Madison',
 'Westchester Village/Unionport',
 'Van Cortlandt Park',
 'Kew Gardens Hills',
 'Douglaston',
 'Roosevelt Island',
 'Bay Terrace/Fort Totten',
 'Bedford Park',
 'Garment District',
 'College Point',
 'Auburndale',
 'Howard Beach',
 'Financial District South',
 'Grymes Hill/Clifton',
 'Manhattan Beach',
 'Laurelton',
 'Flushing Meadows-Corona Park',
 'Riverdale/North Riverdale/Fieldston',
 'East Flushing',
 'Bayside',
 'Marble Hill',
 'Brooklyn Navy Yard',
 'World Trade Center',
 'Randalls Island',
 'Dyker Heights',
 'Ocean Parkway South',
 'Stapleton',
 'Country Club',
 'Van Nest/Morris Park',
 'South Beach/Dongan Hills',
 'West Brighton',
 'Jamaica Bay',
 'Bronx Park',
 'Inwood Hill Park',
 'Heartland Village/Todt Hill',
 'Glen Oaks',
 'Willets Point',
 'Charleston/Tottenville',
 'Breezy Point/Fort Tilden/Riis Beach',
 'City Island',
 'Bloomfield/Emerson Hill',
 'Great Kills',
 'Forest Park/Highland Park',
 'Rossville/Woodrow',
 'Astoria Park',
 'Newark Airport',
 'Green-Wood Cemetery',
 'Battery Park',
 'Marine Park/Floyd Bennett Field',
 'Arrochar/Fort Wadsworth',
 'Arden Heights',
 'Saint George/New Brighton',
 'Mariners Harbor',
 'Pelham Bay Park',
 'Saint Michaels Cemetery/Woodside',
 'Crotona Park',
 'Broad Channel',
 'Port Richmond',
 'Westerleigh',
 "Eltingville/Annadale/Prince's Bay",
 'Oakwood',
 'Freshkills Park',
 "Governor's Island/Ellis Island/Liberty Island"]